podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/GPIOA_S32K.svd.xml
            <register>
               <name>PDDR</name>
               <description>Port Data Direction Register\n
Controls the direction of port pins</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>PDD0</name>
                     <description>Port Data Direction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Input</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Output</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PDD0" > <name>PDD1</name> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD2</name> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD3</name> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD4</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD5</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD7</name> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD8</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD9</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD10</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD11</name> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD12</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD13</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD14</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD15</name> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD16</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD17</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD18</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD19</name> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD20</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD21</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD22</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD23</name> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD24</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD25</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD26</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD27</name> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD28</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD29</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD30</name> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="PDD0" > <name>PDD31</name> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PIDR</name>
               <description>Port Input Disable Register\n
Disables the use of a port pin as input</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>PID0</name>
                     <description>Port Input Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Input (if digital function)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PID0" > <name>PID1</name> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID2</name> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID3</name> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID4</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID5</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID7</name> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID8</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID9</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID10</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID11</name> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID12</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID13</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID14</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID15</name> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID16</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID17</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID18</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID19</name> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID20</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID21</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID22</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID23</name> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID24</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID25</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID26</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID27</name> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID28</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID29</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID30</name> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="PID0" > <name>PID31</name> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
         </registers>
      </peripheral>
